In [41]:
import pandas as pd
import numpy as np

In [33]:
pop = {'Navada':{2001:2.4,2002:2.9},
      'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [34]:
frame3 = pd.DataFrame(pop)
frame3 = pd.DataFrame(frame3, columns=['Ohio','Navada'],index=[2000,2001,2002])
frame3

      Ohio  Navada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [35]:
pd.DataFrame(pop, index=[2001,2002,2003])

      Navada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [36]:
pdata = {'Ohio':frame3['Ohio'][:-1],
        'Navada':frame3['Navada'][:2]}

In [37]:
pd.DataFrame(pdata)

      Ohio  Navada
2000   1.5     NaN
2001   1.7     2.4

In [43]:
data = pd.DataFrame(np.arange(16).reshape((4,4)),index = ['Ohio','Colorado','Utha','New York'],columns=['one','two','three','four'])

In [44]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utha        8    9     10    11
New York   12   13     14    15

In [45]:
data[data<5]=0

In [46]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utha        8    9     10    11
New York   12   13     14    15

In [49]:
data.iloc[:]

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utha        8    9     10    11
New York   12   13     14    15

In [52]:
obj=pd.Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [53]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [54]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [58]:
obj=pd.Series(['a','b','c']*4)

In [59]:
obj

0     a
1     b
2     c
3     a
4     b
5     c
6     a
7     b
8     c
9     a
10    b
11    c
dtype: object

In [60]:
obj.describe()

count     12
unique     3
top        c
freq       4
dtype: object

In [61]:
pip install pandas-datareader

Collecting pandas-datareader
  Downloading pandas_datareader-0.10.0-py3-none-any.whl (109 kB)
Requirement already satisfied: lxml in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from pandas-datareader) (4.6.3)
Requirement already satisfied: requests>=2.19.0 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from pandas-datareader) (2.25.1)
Requirement already satisfied: pandas>=0.23 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from pandas-datareader) (1.2.4)
Requirement already satisfied: numpy>=1.16.5 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from pandas>=0.23->pandas-datareader) (1.20.3)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from pandas>=0.23->pandas-datareader) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from pandas>=0.23->pandas-datareader) (2021.1)
Requirement already satisfied: six>=1.5 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from python-dateutil>=2.7.3->pandas>=0.23->pandas-datareader) (1.16.0)
Requirement already satisfied: idna<3,>=2.5 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2.10)
Requirement already satisfied: chardet<5,>=3.0.2 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from requests>=2.19.0->pandas-datareader) (4.0.0)
Requirement already satisfied: urllib3<1.27,>=1.21.1 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from requests>=2.19.0->pandas-datareader) (1.26.4)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\gregb\appdata\local\programs\python\python39\lib\site-packages (from requests>=2.19.0->pandas-datareader) (2020.12.5)
Installing collected packages: pandas-datareader
Successfully installed pandas-datareader-0.10.0
Note: you may need to restart the kernel to use updated packages.

WARNING: You are using pip version 21.0.1; however, version 21.2.2 is available.
You should consider upgrading via the 'C:\Users\gregb\AppData\Local\Programs\Python\Python39\python.exe -m pip install --upgrade pip' command.

In [66]:
import pandas_datareader.data as web
all_data={ticker: web.get_data_yahoo(ticker)
         for ticker in ['AAPL','IBM','MSFT','GOOG']}
price = pd.DataFrame({ticker: data['Adj Close']for ticker, data in all_data.items()})
volume=pd.DataFrame({ticker:data['Volume']for ticker, data in all_data.items()})

In [67]:
returns = price.pct_change()

In [69]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2021-07-26  0.002895  0.010118 -0.002140  0.013268
2021-07-27 -0.014900 -0.000140 -0.008684 -0.020395
2021-07-28 -0.012196 -0.006865 -0.001117 -0.003034
2021-07-29  0.004552  0.001129  0.000978  0.001166
2021-07-30  0.001511 -0.006834 -0.005550 -0.009664

In [70]:
returns.IBM

Date
2016-08-02         NaN
2016-08-03    0.000560
2016-08-04    0.005477
2016-08-05    0.012070
2016-08-08   -0.000370
                ...
2021-07-26    0.010118
2021-07-27   -0.000140
2021-07-28   -0.006865
2021-07-29    0.001129
2021-07-30   -0.006834
Name: IBM, Length: 1258, dtype: float64

In [71]:
returns.corrwith(volume)

AAPL   -0.063060
IBM    -0.102608
MSFT   -0.056279
GOOG   -0.118103
dtype: float64

In [75]:
 data = pd.DataFrame({'Qu1':[1,3,4,3,4],
                     'Qu2':[2,3,1,2,3],
                     'Qu3':[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [77]:
result =data.apply(pd.value_counts)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0